{
    "events": [
        {
        	"sceneName": "Traveler",
            "description": "Around Midday you meet a traveller on the road, he looks a bit rough and lost. He stops your wagon and says to you: \n \" Howdy there, how y'all doin'? The sheriff in Orato has decided to exile me for no particular reason. I am very hungry, could you not spare me a bit of bean?\" What do you do?",
            "background": 1,
            "decision1Desc": "Shoot him!",
            "decision1": {
                "resource": "Bullets",
                "resourceAmount": 1,
                "outcomeSuccess": {
                    "finalDescription": "You take out your trusty Ratvolver and shoot at the stranger, he expertly dodges the bullet and says \" I like how you think stranger, why dont I join you on your travels? \" \n You gain a new rat.",
                    "someoneDies": -1
                },
                "outcomeFailure": {
                    "finalDescription": "You take out your gun and pull the trigger, and the gun does not do the shooting. You are out of bullets. The stranger runs at you and knocks you out. As you wake up you find that one of your family members is missing.",
                    "someoneDies": 1
                }
            },
            "decision2Desc": "Share some beans with the rat.",
            "decision2": {
                "resource": "Food",
                "resourceAmount": 1,
                "outcomeSuccess": {
                    "finalDescription": "You share some food with the rat. He shares his tragic backstory with you and then walks off into the distance.",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "You loudly proclaim \" Yee-haw, I got food for days \". Reaching into your beanbag your hand comes out empty beanless. You realise that you are out of beans. \n \"Is this some kind of a joke, you know what, I'll eat one of you. Yeah, I am a cannibal. The strange rat knocks you out and steals one of your family members. What a way to go.",
                    "someoneDies": 1
                }
            },
            "decision3Desc": "Give him your child",
            "decision3": {
                "resource": "Child",
                "resourceAmount": 1,
                "outcomeSuccess": {
                    "finalDescription": "Weirdly enough, after you send your child to the strange man, your son shouts \"Father, I have finally found you!\" you suddenly realise that your child is not actually your own, but someone who replaced your own child ages ago. When did this happen? How did a child manage this? Who is this strange man? You will never know.",
                    "someoneDies": 1
                },
                "outcomeFailure": {
                    "finalDescription": "You say to the man \" I will give you my child if you do not to bother me\" He starts slurping, as if hungry, and says \" Yummy Yummy, I mean, I reckon that would work Cowrat!\", as you reach into your wagon you realise that your child is dead. The stranger feels sad for you and you grants you botherfree passage.",
                    "someoneDies": 0
                }
            },
            "decision4Desc": "Ignore",
            "decision4": {
                "resource": "Food",
                "resourceAmount": 3,
                "outcomeSuccess": {
                    "finalDescription": "As you pass by you hear the back of your trusty wagon rip and a scream. You look back to see the traveller running away holding one of your family members and some cans of beans.",
                    "someoneDies": 1
                },
                "outcomeFailure": {
                    "finalDescription": "As you pass by you hear the back of your trusty wagon rip and a scream. You look back to see the traveller running away carrying two of your family members. He must be really strong.",
                    "someoneDies": 2
                }
            }

        },
        {

        	"sceneName": "Rockslide",
            "description": "You are making your way through a narrow pass when suddenly there is a booming noise and rocks begin to fall infront of your wagon. There is a large pile of debris blocking the path, what do you do?",
            "background": 2,
            "decision1Desc": "Shoot the rocks!",
            "decision1": {
                "resource": "Bullets",
                "resourceAmount": 1,
                "outcomeSuccess": {
                    "finalDescription": "You whip out your ratvolver and fire at the rocks. BANG!!! Somehow the bullet manages to hit a stick of dynamite that someone left there earlier. The debris is blasted away, but a loose rock flies into your wagon and kills one of your family members.",
                    "someoneDies": 1
                },
                "outcomeFailure": {
                    "finalDescription": "You confidently step up to the rock and bring out your ratvolver. You carefully aim it at the rocks and pull the trigger. CLICK. You are out of bullets. Your family get to work manually moving the rocks, but someone steps on some loose dynamite which blows up in a massive explosion. The rocks are cleared but some people died.",
                    "someoneDies": 2
                }
            },
            "decision2Desc": "Throw money at the rocks.",
            "decision2": {
                "resource": "Money",
                "resourceAmount": 5,
                "outcomeSuccess": {
                    "finalDescription": "Some friendly looking moles, holding baguettes and wearing berets, emerge out of the ground and take your money. One of them comes up to you and says \" Hew hew hew monssieur, we can clear out theese rockslide for you mon ami!\". The moles proceed to dig away at the rocks, opening the path for you to continue.",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "After you toss money on the floor, a group of angry looking moles, holding baguettes and wearing berets, emerge from the ground! \"Monssieur! You insult us with your petty offer of coins! We will just take your famille instead! Haw haw haw!\". The moles clear out the rocks, but grab a member of your family and head off down a hole.",
                    "someoneDies": 1
                }
            },
            "decision3Desc": "Use some tools to clear the rocks",
            "decision3": {
                "resource": "Tools",
                "resourceAmount": 3,
                "outcomeSuccess": {
                    "finalDescription": "You grab up some of your tools and get to work chipping away at the rocks. You quickly clear enough for your wagon to fit through.",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "You grab up your pultry supply of tools and get to work chipping away at the rocks. One of your family members swings their pickaxe, but stumbles and accidently impales themselves. Ouch.",
                    "someoneDies": 1
                }
            },
            "decision4Desc": "Clear away the rocks by hand",
            "decision4": {
                "resource": "Food",
                "resourceAmount": 5,
                "outcomeSuccess": {
                    "finalDescription": "Your whole family get out the wagon and start clearing away the rocks. It takes a long time and many snack breaks, but you finally make enough room to get the wagon through the passage.",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "Your whole family get out the wagon and start clearing away the rocks. It is very long and tiring work. You finally clear a route for your wagon, however one of your family members collapses from exhaustion.",
                    "someoneDies": 1
                }
            }


        },
        {
        	"sceneName": "Bandits",
            "description": "Late at night, three raccoon bandits step out infront of your wagon holding guns! \n \" There be a toll to pass through this here passage. We'd advise you to pay up with whatever you have, otherwise things might get messy...\" \n What do you do?",
            "background": 4,
            "decision1Desc": "Shoot the bandits!",
            "decision1": {
                "resource": "Bullets",
                "resourceAmount": 1,
                "outcomeSuccess": {
                    "finalDescription": "Quickly snatching up your Ratvolver, you shoot at the raccoon bandits! One of them drops dead on the spot. The raccoon on the left screams out \" TIMMY, NOOOO \" and he takes out his pistol and shoots one of your family members. You reload and quickly finish him off. The final raccoon says \" Screw this!\" and runs off.",
                    "someoneDies": 1
                },
                "outcomeFailure": {
                    "finalDescription": "You grab your gun and pull the trigger, but nothing happens. You are out of bullets. The raccoons share glances with eachother and you see large grins forming at each of their mouthes. \" Well I guess we can just take your lives as payment!!\"",
                    "someoneDies": 5
                }
            },
            "decision2Desc": "Offer the bandits some beans.",
            "decision2": {
                "resource": "Food",
                "resourceAmount": 5,
                "outcomeSuccess": {
                    "finalDescription": "You offer some of your food to the bandits. \"Aww yeah! I love beans!!\" one of them exclaims. They hastily gather up your offering and skip off into the distance.",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "You offer some of your food to the bandits. \" This is hardly enough beans! I guess we will just take one of you as payment!\"",
                    "someoneDies": 1
                }
            },
            "decision3Desc": "Offer the bandits some money",
            "decision3": {
                "resource": "Money",
                "resourceAmount": 5,
                "outcomeSuccess": {
                    "finalDescription": "You offer some of your money to the bandits. \" Oooh weee! We love money!\" the bandits greedily scoop up your coins and run off into the distance, singing to themselves.",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "You offer some of your money to the bandits. \" This isn't even enough to buy a freddo! How about we take one of you instead!\"",
                    "someoneDies": 1
                }
            },
            "decision4Desc": "Trick them with comedy",
            "decision4": {
                "resource": "Comedy",
                "resourceAmount": 2,
                "outcomeSuccess": {
                    "finalDescription": "You and mum rat get out the wagon. You flap your arms and pretend to be a chicken, whilst mum rat jumps up and down proclaiming that she is a frog. The raccoons seem confused at first, but start laughing. \"You guys are quirky! We're just going to let you pass without a toll!\"",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "You get out of the wagon and try to do a handstand to impress the bandits, however your arm slips and you fall flat on your face. The raccoons point and laugh at you. \"Har har har! Let's just kill this joker and steal his stuff!\"",
                    "someoneDies": 1
                }
            }

        },
        {
        "sceneName": "River",
            "description": "In the heat of the afternoon, you find your path blocked by a deep river. \n It is running fast and there is no visible way across. \n What do you do?",
            "background": 3,
            "decision1Desc": "Shoot the river?",
            "decision1": {
                "resource": "Bullets",
                "resourceAmount": 1,
                "outcomeSuccess": {
                    "finalDescription": "Uncertain of what to do, you pull out your Ratvolver and shoot doubtfully into the water. You hear the bullet connect to something. From the water, an angry crocodile emerges and charges your wagon. You urge your beaver on and plunge into the river. The water floods into the wagon, and one of your family is swept out into the river. You watch, helpless as the crocodile takes its meal and dives back under the water, leaving the rest of you alone. Your wagon reaches the opposite bank and you continue on.",
                    "someoneDies": 1
                },
                "outcomeFailure": {
                    "finalDescription": "Uncertain of what to do, you pull out your Ratvolver and aim into the water. You gun clicks, but nothing happens. You're out of bullets. You sit down on the bank, dejectedly, staring out over the water. Your trusty method of shooting things has failed. As you stare, you notice the water staring back, as several crocodiles surface and make their way towards you, looking hungry. If only you had some bullets.",
                    "someoneDies": 5
                }
            },
            "decision2Desc": "Dam the river",
            "decision2": {
                "resource": "Food",
                "resourceAmount": 1,
                "outcomeSuccess": {
                    "finalDescription": "Thinking quickly, you direct your trusty beaver, Justin, to dam the river. Your majestic beast goes to town immedately, expertly felling trees and gracefully piling them up to redirect the river.\" While it worked, several crocodiles surface, but you give them adeath glare. No-one messes with your beautiful beaver and they slink back down, throroughly intimidated. Eventually, you have a makeshift river crossing. Once across, you give justin an extra portion of feed for being a wonderful boy.",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "After some deliberation, you attempt to direct your lazy beaver, Justin, to dam the river. Your terrible beast refuses to do so without extra feed, which you do not have. So insulted by this demand is this wretched creature that it fells a tree, directly onto where you are waiting, squashing a member of your family. The grizzly branch rolls into the river, forming an unstable bridge",
                    "someoneDies": 1
                }
            },
            "decision3Desc": "Pay the river?",
            "decision3": {
                "resource": "Money",
                "resourceAmount": 1,
                "outcomeSuccess": {
                    "finalDescription": "You remember your grandfather sitting you on his lap and telling you that in life, throwing money at your problems is sure to make them go away. You never quite knew what he meant by that but, repeating his old adage, you pull back your arm and toss a coin into the river. It glints in the sunlight as it sails through the air, making you squint and turn away. As you do so, you notice that further downstream is an old bridge. It looks unstable and rickety, but usable. Looks like ol' Grandpappy was right once again!",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "You remember your grandfather sitting you on his lap and telling you that in life, throwing money at your problems is sure to make them go away. You glance at your empty coin purse, look back at the wagon and tell your family to swim across. One rat gets in before you glance back up stream, and notice a bridge. Your family member couldn't actually swim and ends up drowning",
                    "someoneDies": 1
                }
            },
            "decision4Desc": "Swim",
            "decision4": {
                "resource": "Tools",
                "resourceAmount": 2,
                "outcomeSuccess": {
                    "finalDescription": "You look at the river. \"Hah! Nature calls this an obstacle??\" You laugh in Mother Nature's face and urge your trusty beaver to go and ford the river. The water rushes into the wagon, damaging it, but you make it to the other side. \"Take that, Geography!\". Once away from the water you spend a while fixing the damage to your wagon.",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "You look at the river. \"Hah! Nature calls this an obstacle??\" You laugh in Mother Nature face and urge your useless beaver to go and ford the river. The water rushes into your wagon, washing everything apart and sending you all to a watery grave\"",
                    "someoneDies": 5
                }
            }
        },

        {

        	"sceneName": "Ratter",
            "description": "A large figure appears before your wagon, blocking the way forward. You look up to see a snake who says to itself \"What'sss that? A tassty ssnack?\"",
            "background": 1,
            "decision1Desc": "Shoot the snake!",
            "decision1": {
                "resource": "Bullets",
                "resourceAmount": 1,
                "outcomeSuccess": {
                    "finalDescription": "You grab your ratvolver and quickly release a shot aimed at the snake's head. The bullet hits the snake dead on and it collapses to the floor",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "You grab your ratvolver and quickly release a shot aimed at the snake's head. CLICK. You are out of bullets, so nothing happens. The snake looks down at you and laughs \"Sssuch a sshame little mouse. Time for a ssnack!\". The snake eats one of your family members.",
                    "someoneDies": 2
                }
            },
            "decision2Desc": "Give it some food",
            "decision2": {
                "resource": "Comedy",
                "resourceAmount": 2,
                "outcomeSuccess": {
                    "finalDescription": "You tell the snake that it can take some of your food. \"Oh, thanksss!\" it replies, as it proceeds to eat one of your family members.",
                    "someoneDies": 1
                },
                "outcomeFailure": {
                    "finalDescription": "You tell the snake that it can take some of your food. \"Oh thanksss!\" it replies, then it eats you whole.",
                    "someoneDies": 1
                }
            },
            "decision3Desc": "Throw money at the snake",
            "decision3": {
                "resource": "Money",
                "resourceAmount": 4,
                "outcomeSuccess": {
                    "finalDescription": "You throw some money at the snake. It looks down at the money, then back at you. \"How am I ssupposed to pick that up? I guessss one of you can carry it for me...\". The snake imprisons one of your family. ",
                    "someoneDies": 1
                },
                "outcomeFailure": {
                    "finalDescription": "You throw a few coins at the snake. \"Firsstly, how am I ssupposed to pick that up? Ssecondly, there'ss barely enough money there to cover my weekly sshop! I think I'll just eat a few of you instead.\"",
                    "someoneDies": 2
                }
            },
            "decision4Desc": "Ignore the snake",
            "decision4": {
                "resource": "Comedy",
                "resourceAmount": 5,
                "outcomeSuccess": {
                    "finalDescription": "You are pretty sure that a snakes' vision is based on movement. You stay completely still. The snake looks at your wagon and says to itself \"What are those smelly dead ratsss doing in that cart? I hate the taste of rotting rat, so I guesss I will leave them alone.\"",
                    "someoneDies": 0
                },
                "outcomeFailure": {
                    "finalDescription": "You are pretty sure that a snakes' vision is based on movement. You try to stay completely still as the snake slithers over to inspect your wagon. It looks like it is about to leave, when you suddenly get an itch in your left nostril. ACHOO. As you sneeze, the snake looks directly at you, licks its snake lips and swallows you whole.",
                    "someoneDies": 1
                }
            }


        }]
    }
